# drop columns

In [8]:
import pandas as pd
df=pd.read_csv('./grouped_data4.csv')
df

,credit_score,credit__section,country,age,age_group,gender,age_group_gender,tenure,balance,balance_group,balance_per_age,balance_per_tenure,products_number,credit_card,salary_per_products,active_member,estimated_salary,salary_range,churn
0,619,Poor,France,42,forties,Female,forties_Female,2,119839.69,zero,2853.325952,0.000000,1,1,101348.880,1,101348.88,very high,1
1,608,Poor,Spain,41,forties,Female,forties_Female,1,83807.86,rest,2044.094146,83807.860000,1,0,112542.580,1,112542.58,very high,0
2,502,Very poor,France,42,forties,Female,forties_Female,8,159660.80,rest,3801.447619,19957.600000,3,1,37977.190,0,113931.57,very high,1
3,699,Fair,France,39,thirties,Female,thirties_Female,1,119839.69,zero,3072.812564,0.000000,2,0,46913.315,0,93826.63,high,0
4,850,Excellent,Spain,43,forties,Female,forties_Female,2,125510.82,rest,2918.856279,62755.410000,1,1,79084.100,1,79084.10,high,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,771,Good,France,39,thirties,Male,thirties_Male,5,119839.69,zero,3072.812564,0.000000,2,1,48135.320,0,96270.64,high,0
9996,516,Very poor,France,35,thirties,Male,thirties_Male,10,57369.61,rest,1639.131714,5736.961000,1,1,101699.770,1,101699.77,very high,0
9997,709,Fair,France,36,thirties,Female,thirties_Female,7,119839.69,zero,3328.880278,0.000000,1,0,42085.580,1,42085.58,medium,1
9998,772,Good,Germany,42,forties,Male,forties_Male,3,75075.31,rest,1787.507381,25025.103333,2,1,46444.260,0,92888.52,high,1
9999,792,Excellent,France,28,twenties,Female,twenties_Female,4,130142.79,rest,4647.956786,32535.697500,1,1,38190.780,0,38190.78,medium,0

In [11]:
df=df.drop(['credit_score','age','age_group','gender',
        'balance','balance_group','products_number',
        'credit_card','estimated_salary'],axis=1)
df

,credit__section,country,age_group_gender,tenure,balance_per_age,balance_per_tenure,salary_per_products,active_member,salary_range,churn
0,Poor,France,forties_Female,2,2853.325952,0.000000,101348.880,1,very high,1
1,Poor,Spain,forties_Female,1,2044.094146,83807.860000,112542.580,1,very high,0
2,Very poor,France,forties_Female,8,3801.447619,19957.600000,37977.190,0,very high,1
3,Fair,France,thirties_Female,1,3072.812564,0.000000,46913.315,0,high,0
4,Excellent,Spain,forties_Female,2,2918.856279,62755.410000,79084.100,1,high,0
...,...,...,...,...,...,...,...,...,...,...
9995,Good,France,thirties_Male,5,3072.812564,0.000000,48135.320,0,high,0
9996,Very poor,France,thirties_Male,10,1639.131714,5736.961000,101699.770,1,very high,0
9997,Fair,France,thirties_Female,7,3328.880278,0.000000,42085.580,1,medium,1
9998,Good,Germany,forties_Male,3,1787.507381,25025.103333,46444.260,0,high,1
9999,Excellent,France,twenties_Female,4,4647.956786,32535.697500,38190.780,0,medium,0

In [12]:
df.shape

(10000, 10)

# one hot encoding

In [13]:
df['credit__section'].unique()

array(['Poor', 'Very poor', 'Fair', 'Excellent', 'Good'], dtype=object)

In [24]:
df_credit=pd.DataFrame({'score':['Very poor','Poor','Fair', 'Good','Excellent']})

dummies=pd.get_dummies(df_credit)
dummies=dummies.astype(int)
dummies

   score_Excellent  score_Fair  score_Good  score_Poor  score_Very poor
0                0           0           0           0                1
1                0           0           0           1                0
2                0           1           0           0                0
3                0           0           1           0                0
4                1           0           0           0                0

In [25]:
df['country'].unique()

array(['France', 'Spain', 'Germany'], dtype=object)

In [ ]:
df_credit=pd.DataFrame({'country':['Very poor','Poor','Fair', 'Good','Excellent']})

dummies=pd.get_dummies(df_credit)
dummies=dummies.astype(int)
dummies